### Imports

In [1]:
import requests
import pandas as pd

In [10]:
df = pd.read_csv('/Users/hector/codeup-data-science/time-series-exercisess/GlobalLandTemperaturesByCity.csv')
df.head(2)

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8599212 entries, 0 to 8599211
Data columns (total 7 columns):
 #   Column              Dtype
---  ------              -----
 0   date                object
 1   avg_temp            float64
 2   avgtemp_uncetainty  float64
 3   city                object
 4   country             object
 5   latitude            object
 6   longitude           object
dtypes: float64(2), object(5)
memory usage: 459.2+ MB

In [13]:
#change date from object to datetime

In [15]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
avg_temp,8235082.0,16.727433,10.353442,-42.704,10.299,18.831,25.210,39.651
avgtemp_uncetainty,8235082.0,1.028575,1.129733,0.034,0.337,0.591,1.349,15.396

In [16]:
df.isnull().sum()

date                       0
avg_temp              364130
avgtemp_uncetainty    364130
city                       0
country                    0
latitude                   0
longitude                  0
dtype: int64

In [17]:
df.shape

(8599212, 7)

In [20]:
df.columns

Index(['date', 'avg_temp', 'avgtemp_uncetainty', 'city', 'country', 'latitude',
       'longitude'],
      dtype='object')

In [32]:
df.country.describe()

count     8599212
unique        159
top         India
freq      1014906
Name: country, dtype: object

In [38]:
df['country'].value_counts()['United States']

687289

In [41]:
#filtered country by United States
df = df[df['country']=='United States']
df.head(2)

,date,avg_temp,avgtemp_uncetainty,city,country,latitude,longitude
47555,1820-01-01,2.101,3.217,Abilene,United States,32.95N,100.53W
47556,1820-02-01,6.926,2.853,Abilene,United States,32.95N,100.53W

In [43]:
df.city.value_counts()

Springfield         9545
Columbus            6478
Aurora              6101
Arlington           5564
Peoria              5384
                    ...
Sacramento          1977
San Jose            1977
Rancho Cucamonga    1977
Oakland             1977
Burbank             1977
Name: city, Length: 248, dtype: int64

In [44]:
df.city.describe()

count          687289
unique            248
top       Springfield
freq             9545
Name: city, dtype: object

In [50]:
df = df[df['city']=='Springfield']
df.head()

,date,avg_temp,avgtemp_uncetainty,city,country,latitude,longitude
7139118,1758-03-01,6.423,3.742,Springfield,United States,37.78N,93.56W
7139119,1758-04-01,12.140,5.432,Springfield,United States,37.78N,93.56W
7139120,1758-05-01,16.998,3.760,Springfield,United States,37.78N,93.56W
7139121,1758-06-01,22.852,3.519,Springfield,United States,37.78N,93.56W
7139122,1758-07-01,25.195,4.888,Springfield,United States,37.78N,93.56W

In [46]:
df.shape

(9545, 7)

In [47]:
df.isnull().sum()

date                    0
avg_temp              398
avgtemp_uncetainty    398
city                    0
country                 0
latitude                0
longitude               0
dtype: int64

In [48]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
avg_temp,9147.0,10.647931,9.918251,-11.487,1.904,11.500,19.4125,30.660
avgtemp_uncetainty,9147.0,1.329609,1.357864,0.060,0.303,0.639,2.1930,10.117

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9545 entries, 7139118 to 7148662
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   date                9545 non-null   object
 1   avg_temp            9147 non-null   float64
 2   avgtemp_uncetainty  9147 non-null   float64
 3   city                9545 non-null   object
 4   country             9545 non-null   object
 5   latitude            9545 non-null   object
 6   longitude           9545 non-null   object
dtypes: float64(2), object(5)
memory usage: 596.6+ KB

### Takeaways for data prep
1. fill nulls with averages since the amount fall just under 5% 
2. correct/convert temp values (temp values in celsius)
3. remove characters from long/lat 
4. drop long/lat, city and country
5. convert date to datetime
6. set index
7. rename columns date, springfield_avgtemp, springfield_avgtempuncertainty

In [ ]:
#possibly convert temps???? What are these temp measurements in?